#+title: System Information

* Output System variables
#+NAME: OS
#+begin_src emacs-lisp
(defun display-linux-distribution ()
  "Display the Linux distribution."
  (interactive)
  (let ((os-release-file "/etc/os-release"))
    (if (file-readable-p os-release-file)
        (with-temp-buffer
          (insert-file-contents os-release-file)
          (goto-char (point-min))
          (let ((distribution nil))
            (while (re-search-forward "^NAME=\"\\(.*\\)\"$" nil t)
              (setq distribution (match-string 1)))
            (if distribution
                (message "%s" distribution)
              (message "Linux Distribution: Unknown"))))
      (message "%s" system-type))))

(display-linux-distribution)
#+end_src

#+RESULTS:
: darwin

#+NAME: HOSTNAME
#+begin_src emacs-lisp
(system-name)
#+end_src

#+RESULTS: HOSTNAME
: Kays-Mac-mini.local
